g4klx/MMDVM/STM32F7XX_Lib/STM32F7xx_StdPeriph_Driver/inc/stm32f7xx_rcc.h
/** @defgroup RCC_I2S_Clock_Source
  * @{
  */
#define RCC_I2SCLKSource_PLLI2S             ((uint32_t)0x00)
#define RCC_I2SCLKSource_Ext                ((uint32_t)RCC_CFGR_I2SSRC)


#define IS_RCC_I2SCLK_SOURCE(SOURCE) (((SOURCE) == RCC_I2SCLKSource_PLLI2S) || ((SOURCE) == RCC_I2SCLKSource_Ext))                                
/**
  * @}
  */

/** @defgroup RCC_SAI_Clock_Source
  * @{
  */
#define RCC_SAICLKSource_PLLSAI             ((uint32_t)0x00)
#define RCC_SAICLKSource_PLLI2S             ((uint32_t)RCC_DCKCFGR1_SAI2SEL_0)
#define RCC_SAICLKSource_CKIN               ((uint32_t)RCC_DCKCFGR1_SAI2SEL_1)

#define IS_RCC_SAICLK_SOURCE(SOURCE) (((SOURCE) == RCC_SAICLKSource_PLLSAI) || ((SOURCE) == RCC_SAICLKSource_PLLI2S) || \
                                      ((SOURCE) == RCC_SAICLKSource_CKIN))                                
/**
  * @}
  */    
    
/** @defgroup RCC_SAI_Instance
  * @{
  */
#define RCC_SAIInstance_SAI1             ((uint8_t)0x00)
#define RCC_SAIInstance_SAI2             ((uint8_t)0x01)
#define IS_RCC_SAI_INSTANCE(BUS) (((BUS) == RCC_SAIInstance_SAI1) || ((BUS) == RCC_SAIInstance_SAI2))                                
/**
  * @}
  */

/** @defgroup RCC_TIM_PRescaler_Selection
  * @{
  */
#define RCC_TIMPrescDesactivated             ((uint8_t)0x00)
#define RCC_TIMPrescActivated                ((uint8_t)0x01)

#define IS_RCC_TIMCLK_PRESCALER(VALUE) (((VALUE) == RCC_TIMPrescDesactivated) || ((VALUE) == RCC_TIMPrescActivated))
/**
  * @}
  */

/** @defgroup RCC_SDIO_Clock_Source_Selection
  * @{
  */
#define RCC_SDMMCCLKSource_48MHZ              ((uint8_t)0x00)
#define RCC_SDMMCCLKSource_SYSCLK             ((uint8_t)0x01)
#define IS_RCC_SDMMC_CLOCKSOURCE(CLKSOURCE)   (((CLKSOURCE) == RCC_SDMMCCLKSource_48MHZ) || \
                                              ((CLKSOURCE) == RCC_SDMMCCLKSource_SYSCLK))
/**
  * @}
  */

/** @defgroup RCC_48MHZ_Clock_Source_Selection
  * @{
  */
#define RCC_48MHZCLKSource_PLL                ((uint8_t)0x00)
#define RCC_48MHZCLKSource_PLLSAI             ((uint8_t)0x01)
#define IS_RCC_48MHZ_CLOCKSOURCE(CLKSOURCE)   (((CLKSOURCE) == RCC_48MHZCLKSource_PLL) || \
                                               ((CLKSOURCE) == RCC_48MHZCLKSource_PLLSAI))
/**
  * @}
  */

/** @defgroup RCC_SPDIFRX_Clock_Source_Selection
  * @{
  */
#define RCC_SPDIFRXCLKSource_PLLR                 ((uint8_t)0x00)
#define RCC_SPDIFRXCLKSource_PLLI2SP              ((uint8_t)0x01)
#define IS_RCC_SPDIFRX_CLOCKSOURCE(CLKSOURCE)     (((CLKSOURCE) == RCC_SPDIFRXCLKSource_PLLR) || \
                                                   ((CLKSOURCE) == RCC_SPDIFRXCLKSource_PLLI2SP))
/**
  * @}
  */

/** @defgroup RCC_CEC_Clock_Source_Selection
  * @{
  */
#define RCC_CECCLKSource_HSIDiv488            ((uint8_t)0x00)
#define RCC_CECCLKSource_LSE                  ((uint8_t)0x01)
#define IS_RCC_CEC_CLOCKSOURCE(CLKSOURCE)     (((CLKSOURCE) == RCC_CECCLKSource_HSIDiv488) || \
                                               ((CLKSOURCE) == RCC_CECCLKSource_LSE))
/**
  * @}
  */

/** @defgroup RCC_I2C_Clock_Source
  * @{
  */
#define RCC_I2CCLKSource_APB                   ((uint32_t)0x00)
#define RCC_I2CCLKSource_SYSCLK                ((uint32_t)RCC_DCKCFGR2_I2C1SEL_0)
#define RCC_I2CCLKSource_HSI                   ((uint32_t)RCC_DCKCFGR2_I2C1SEL_1)
    
#define IS_RCC_I2C_CLOCKSOURCE(SOURCE) (((SOURCE) == RCC_I2CCLKSource_APB) || ((SOURCE) == RCC_I2CCLKSource_SYSCLK) || \
                                         ((SOURCE) == RCC_I2CCLKSource_HSI))                                
/**
  * @}
  */


/** @defgroup RCC_USART_UART_Clock_Source
  * @{
  */
#define RCC_USARTCLKSource_APB                  ((uint32_t)0x00)
#define RCC_USARTCLKSource_SYSCLK               ((uint32_t)RCC_DCKCFGR2_USART1SEL_0)
#define RCC_USARTCLKSource_HSI                  ((uint32_t)RCC_DCKCFGR2_USART1SEL_1)
#define RCC_USARTCLKSource_LSE                  ((uint32_t)RCC_DCKCFGR2_USART1SEL)
#define IS_RCC_USART_CLOCKSOURCE(SOURCE) (((SOURCE) == RCC_USARTCLKSource_APB) || ((SOURCE) == RCC_USARTCLKSource_SYSCLK) || \
                                         ((SOURCE) == RCC_USARTCLKSource_HSI)) || ((SOURCE) == RCC_USARTCLKSource_LSE)
/**
  * @}
  */

/** @defgroup RCCEx_LPTIM1_Clock_Source RCCEx LPTIM1 Clock Source
  * @{
  */
#define RCC_LPTIMCLKSource_APB                 ((uint32_t)0x00000000)
#define RCC_LPTIMCLKSource_LSI                 RCC_DCKCFGR2_LPTIM1SEL_0
#define RCC_LPTIMCLKSource_HSI                 RCC_DCKCFGR2_LPTIM1SEL_1
#define RCC_LPTIMCLKSource_LSE                 RCC_DCKCFGR2_LPTIM1SEL

#define IS_RCC_LPTIM_CLOCKSOURCE(SOURCE) (((SOURCE) == RCC_LPTIMCLKSource_APB) || ((SOURCE) == RCC_LPTIMCLKSource_LSI) || \
                                         ((SOURCE) == RCC_LPTIMCLKSource_HSI) || ((SOURCE) == RCC_LPTIMCLKSource_LSE))   
/**
  * @}
  */
    
/** @defgroup RCC_AHB1_Peripherals 
  * @{
  */ 
#define RCC_AHB1Periph_GPIOA             ((uint32_t)RCC_AHB1ENR_GPIOAEN)
#define RCC_AHB1Periph_GPIOB             ((uint32_t)RCC_AHB1ENR_GPIOBEN)
#define RCC_AHB1Periph_GPIOC             ((uint32_t)RCC_AHB1ENR_GPIOCEN)
#define RCC_AHB1Periph_GPIOD             ((uint32_t)RCC_AHB1ENR_GPIODEN)
#define RCC_AHB1Periph_GPIOE             ((uint32_t)RCC_AHB1ENR_GPIOEEN)
#define RCC_AHB1Periph_GPIOF             ((uint32_t)RCC_AHB1ENR_GPIOFEN)
#define RCC_AHB1Periph_GPIOG             ((uint32_t)RCC_AHB1ENR_GPIOGEN)
#define RCC_AHB1Periph_GPIOH             ((uint32_t)RCC_AHB1ENR_GPIOHEN)
#define RCC_AHB1Periph_GPIOI             ((uint32_t)RCC_AHB1ENR_GPIOIEN)
#if defined(STM32F767xx)
#define RCC_AHB1Periph_GPIOJ             ((uint32_t)RCC_AHB1ENR_GPIOJEN)
#define RCC_AHB1Periph_GPIOK             ((uint32_t)RCC_AHB1ENR_GPIOKEN)
#endif
#define RCC_AHB1Periph_CRC               ((uint32_t)RCC_AHB1ENR_CRCEN)
#define RCC_AHB1Periph_BKPSRAM           ((uint32_t)RCC_AHB1ENR_BKPSRAMEN)
#define RCC_AHB1Periph_DTCMRAM           ((uint32_t)RCC_AHB1ENR_DTCMRAMEN)
#define RCC_AHB1Periph_DMA1              ((uint32_t)RCC_AHB1ENR_DMA1EN)
#define RCC_AHB1Periph_DMA2              ((uint32_t)RCC_AHB1ENR_DMA2EN)
#define RCC_AHB1Periph_DMA2D             ((uint32_t)RCC_AHB1ENR_DMA2DEN)
#define RCC_AHB1Periph_ETH_MAC           ((uint32_t)RCC_AHB1ENR_ETHMACEN)
#define RCC_AHB1Periph_ETH_MAC_Tx        ((uint32_t)RCC_AHB1ENR_ETHMACTXEN)
#define RCC_AHB1Periph_ETH_MAC_Rx        ((uint32_t)RCC_AHB1ENR_ETHMACRXEN)
#define RCC_AHB1Periph_ETH_MAC_PTP       ((uint32_t)RCC_AHB1ENR_ETHMACPTPEN)
#define RCC_AHB1Periph_OTG_HS            ((uint32_t)RCC_AHB1ENR_OTGHSEN)
#define RCC_AHB1Periph_OTG_HS_ULPI       ((uint32_t)RCC_AHB1ENR_OTGHSULPIEN)

#define IS_RCC_AHB1_CLOCK_PERIPH(PERIPH) ((((PERIPH) & 0x810BE800) == 0x00) && ((PERIPH) != 0x00))
#define IS_RCC_AHB1_RESET_PERIPH(PERIPH) ((((PERIPH) & 0xDD1FE800) == 0x00) && ((PERIPH) != 0x00))
#define IS_RCC_AHB1_LPMODE_PERIPH(PERIPH) ((((PERIPH) & 0x81106800) == 0x00) && ((PERIPH) != 0x00))

/**
  * @}
  */ 

/** @defgroup RCC_AHB2_Peripherals 
  * @{
  */  
#define RCC_AHB2Periph_DCMI              ((uint32_t)RCC_AHB2ENR_DCMIEN)
#define RCC_AHB2Periph_RNG               ((uint32_t)RCC_AHB2ENR_RNGEN)
#define RCC_AHB2Periph_OTG_FS            ((uint32_t)RCC_AHB2ENR_OTGFSEN)

#if defined (STM32F756xx)
#define RCC_AHB2Periph_CRYP              ((uint32_t)RCC_AHB2ENR_CRYPEN)
#define RCC_AHB2Periph_HASH              ((uint32_t)RCC_AHB2ENR_HASHEN)
#endif /* STM32F756xx */

