g4klx/MMDVM/STM32F7XX_Lib/STM32F7xx_StdPeriph_Driver/inc/stm32f7xx_rcc.h
#define IS_RCC_AHB2_PERIPH(PERIPH) ((((PERIPH) & 0xFFFFFF0E) == 0x00) && ((PERIPH) != 0x00))
/**
  * @}
  */ 

/** @defgroup RCC_AHB3_Peripherals 
  * @{
  */ 
#define RCC_AHB3Periph_FMC                 ((uint32_t)RCC_AHB3ENR_FMCEN)
#define RCC_AHB3Periph_QSPI                ((uint32_t)RCC_AHB3ENR_QSPIEN)
#define IS_RCC_AHB3_PERIPH(PERIPH) ((((PERIPH) & 0xFFFFFFFC) == 0x00) && ((PERIPH) != 0x00))
    
/**
  * @}
  */ 

/** @defgroup RCC_APB1_Peripherals 
  * @{
  */ 
#define RCC_APB1Periph_TIM2              ((uint32_t)RCC_APB1ENR_TIM2EN)
#define RCC_APB1Periph_TIM3              ((uint32_t)RCC_APB1ENR_TIM3EN)
#define RCC_APB1Periph_TIM4              ((uint32_t)RCC_APB1ENR_TIM4EN)
#define RCC_APB1Periph_TIM5              ((uint32_t)RCC_APB1ENR_TIM5EN)
#define RCC_APB1Periph_TIM6              ((uint32_t)RCC_APB1ENR_TIM6EN)
#define RCC_APB1Periph_TIM7              ((uint32_t)RCC_APB1ENR_TIM7EN)
#define RCC_APB1Periph_TIM12             ((uint32_t)RCC_APB1ENR_TIM12EN)
#define RCC_APB1Periph_TIM13             ((uint32_t)RCC_APB1ENR_TIM13EN)
#define RCC_APB1Periph_TIM14             ((uint32_t)RCC_APB1ENR_TIM14EN)
#define RCC_APB1Periph_LPTIM1            ((uint32_t)RCC_APB1ENR_LPTIM1EN)
#define RCC_APB1Periph_WWDG              ((uint32_t)RCC_APB1ENR_WWDGEN)
#define RCC_APB1Periph_SPI2              ((uint32_t)RCC_APB1ENR_SPI2EN)
#define RCC_APB1Periph_SPI3              ((uint32_t)RCC_APB1ENR_SPI3EN)
#define RCC_APB1Periph_SPDIFRX           ((uint32_t)RCC_APB1ENR_SPDIFRXEN)
#define RCC_APB1Periph_USART2            ((uint32_t)RCC_APB1ENR_USART2EN)
#define RCC_APB1Periph_USART3            ((uint32_t)RCC_APB1ENR_USART3EN)
#define RCC_APB1Periph_UART4             ((uint32_t)RCC_APB1ENR_UART4EN)
#define RCC_APB1Periph_UART5             ((uint32_t)RCC_APB1ENR_UART5EN)
#define RCC_APB1Periph_I2C1              ((uint32_t)RCC_APB1ENR_I2C1EN)
#define RCC_APB1Periph_I2C2              ((uint32_t)RCC_APB1ENR_I2C2EN)
#define RCC_APB1Periph_I2C3              ((uint32_t)RCC_APB1ENR_I2C3EN)
#define RCC_APB1Periph_I2C4              ((uint32_t)RCC_APB1ENR_I2C4EN)
#define RCC_APB1Periph_CAN1              ((uint32_t)RCC_APB1ENR_CAN1EN)
#define RCC_APB1Periph_CAN2              ((uint32_t)RCC_APB1ENR_CAN2EN)
#define RCC_APB1Periph_CEC               ((uint32_t)RCC_APB1ENR_CECEN)
#define RCC_APB1Periph_PWR               ((uint32_t)RCC_APB1ENR_PWREN)
#define RCC_APB1Periph_DAC               ((uint32_t)RCC_APB1ENR_DACEN)
#define RCC_APB1Periph_UART7             ((uint32_t)RCC_APB1ENR_UART7EN)
#define RCC_APB1Periph_UART8             ((uint32_t)RCC_APB1ENR_UART8EN)
#define IS_RCC_APB1_PERIPH(PERIPH) ((((PERIPH) & 0x00003600) == 0x00) && ((PERIPH) != 0x00))
/**
  * @}
  */ 

/** @defgroup RCC_APB2_Peripherals 
  * @{
  */ 
#define RCC_APB2Periph_TIM1              ((uint32_t)RCC_APB2ENR_TIM1EN)
#define RCC_APB2Periph_TIM8              ((uint32_t)RCC_APB2ENR_TIM8EN)
#define RCC_APB2Periph_USART1            ((uint32_t)RCC_APB2ENR_USART1EN)
#define RCC_APB2Periph_USART6            ((uint32_t)RCC_APB2ENR_USART6EN)
#define RCC_APB2Periph_ADC               ((uint32_t)RCC_APB2ENR_ADC1EN)
#define RCC_APB2Periph_ADC1              ((uint32_t)RCC_APB2ENR_ADC1EN)
#define RCC_APB2Periph_ADC2              ((uint32_t)RCC_APB2ENR_ADC2EN)
#define RCC_APB2Periph_ADC3              ((uint32_t)RCC_APB2ENR_ADC3EN)
#define RCC_APB2Periph_SDMMC1            ((uint32_t)RCC_APB2ENR_SDMMC1EN)
#define RCC_APB2Periph_SPI1              ((uint32_t)RCC_APB2ENR_SPI1EN)
#define RCC_APB2Periph_SPI4              ((uint32_t)RCC_APB2ENR_SPI4EN)
#define RCC_APB2Periph_SYSCFG            ((uint32_t)RCC_APB2ENR_SYSCFGEN)
#define RCC_APB2Periph_TIM9              ((uint32_t)RCC_APB2ENR_TIM9EN)
#define RCC_APB2Periph_TIM10             ((uint32_t)RCC_APB2ENR_TIM10EN)
#define RCC_APB2Periph_TIM11             ((uint32_t)RCC_APB2ENR_TIM11EN)
#define RCC_APB2Periph_SPI5              ((uint32_t)RCC_APB2ENR_SPI5EN)
#define RCC_APB2Periph_SPI6              ((uint32_t)RCC_APB2ENR_SPI6EN)
#define RCC_APB2Periph_SAI1              ((uint32_t)RCC_APB2ENR_SAI1EN)
#define RCC_APB2Periph_SAI2              ((uint32_t)RCC_APB2ENR_SAI2EN)
#define RCC_APB2Periph_LTDC              ((uint32_t)RCC_APB2ENR_LTDCEN)

#define IS_RCC_APB2_PERIPH(PERIPH) ((((PERIPH) & 0xF30880CC) == 0x00) && ((PERIPH) != 0x00))
#define IS_RCC_APB2_RESET_PERIPH(PERIPH) ((((PERIPH) & 0xF30886CC) == 0x00) && ((PERIPH) != 0x00))

/**
  * @}
  */ 
    
    
    
/** @defgroup RCC_MCO1_Clock_Source_Prescaler
  * @{
  */
#define RCC_MCO1Source_HSI               ((uint32_t)0x00000000)
#define RCC_MCO1Source_LSE               ((uint32_t)RCC_CFGR_MCO1_0)
#define RCC_MCO1Source_HSE               ((uint32_t)RCC_CFGR_MCO1_1)
#define RCC_MCO1Source_PLLCLK            ((uint32_t)RCC_CFGR_MCO1)
#define RCC_MCO1Div_1                    ((uint32_t)0x00000000)
#define RCC_MCO1Div_2                    ((uint32_t)RCC_CFGR_MCO1PRE_2)
#define RCC_MCO1Div_3                    ((uint32_t)RCC_CFGR_MCO1PRE_0 | RCC_CFGR_MCO1PRE_2)
#define RCC_MCO1Div_4                    ((uint32_t)RCC_CFGR_MCO1PRE_1 | RCC_CFGR_MCO1PRE_2)
#define RCC_MCO1Div_5                    ((uint32_t)RCC_CFGR_MCO1PRE)
#define IS_RCC_MCO1SOURCE(SOURCE) (((SOURCE) == RCC_MCO1Source_HSI) || ((SOURCE) == RCC_MCO1Source_LSE) || \
                                   ((SOURCE) == RCC_MCO1Source_HSE) || ((SOURCE) == RCC_MCO1Source_PLLCLK))
                                   
#define IS_RCC_MCO1DIV(DIV) (((DIV) == RCC_MCO1Div_1) || ((DIV) == RCC_MCO1Div_2) || \
                             ((DIV) == RCC_MCO1Div_3) || ((DIV) == RCC_MCO1Div_4) || \
                             ((DIV) == RCC_MCO1Div_5)) 
/**
  * @}
  */ 
  
/** @defgroup RCC_MCO2_Clock_Source_Prescaler
  * @{
  */
#define RCC_MCO2Source_SYSCLK            ((uint32_t)0x00000000)
#define RCC_MCO2Source_PLLI2SCLK         ((uint32_t)RCC_CFGR_MCO2_0)
#define RCC_MCO2Source_HSE               ((uint32_t)RCC_CFGR_MCO2_1)
#define RCC_MCO2Source_PLLCLK            ((uint32_t)RCC_CFGR_MCO2)
#define RCC_MCO2Div_1                    ((uint32_t)0x00000000)
#define RCC_MCO2Div_2                    ((uint32_t)RCC_CFGR_MCO2PRE_2)
#define RCC_MCO2Div_3                    ((uint32_t)RCC_CFGR_MCO2PRE_0 | RCC_CFGR_MCO2PRE_2)
#define RCC_MCO2Div_4                    ((uint32_t)RCC_CFGR_MCO2PRE_1 | RCC_CFGR_MCO2PRE_2)
#define RCC_MCO2Div_5                    ((uint32_t)RCC_CFGR_MCO2PRE)
#define IS_RCC_MCO2SOURCE(SOURCE) (((SOURCE) == RCC_MCO2Source_SYSCLK) || ((SOURCE) == RCC_MCO2Source_PLLI2SCLK)|| \
                                   ((SOURCE) == RCC_MCO2Source_HSE) || ((SOURCE) == RCC_MCO2Source_PLLCLK))
                                   
#define IS_RCC_MCO2DIV(DIV) (((DIV) == RCC_MCO2Div_1) || ((DIV) == RCC_MCO2Div_2) || \
                             ((DIV) == RCC_MCO2Div_3) || ((DIV) == RCC_MCO2Div_4) || \
                             ((DIV) == RCC_MCO2Div_5))                             
/**
  * @}
  */ 

/** @defgroup RCC_Flag RCC Flags
  *        Elements values convention: 0XXYYYYYb
  *           - YYYYY  : Flag position in the register
  *           - 0XX  : Register index
  *                 - 01: CR register
  *                 - 10: BDCR register
  *                 - 11: CSR register
  * @{
  */
/* Flags in the CR register */
#define RCC_FLAG_HSIRDY                  ((uint8_t)0x21)
#define RCC_FLAG_HSERDY                  ((uint8_t)0x31)
#define RCC_FLAG_PLLRDY                  ((uint8_t)0x39)
#define RCC_FLAG_PLLI2SRDY               ((uint8_t)0x3B)
#define RCC_FLAG_PLLSAIRDY               ((uint8_t)0x3D)

/* Flags in the BDCR register */
#define RCC_FLAG_LSERDY                  ((uint8_t)0x41)

